In [52]:
import numpy as np
import pandas as pd

In [12]:
x= np.array([[1,2,3,4],[5,6,7,8]])

In [18]:
x[0][2]

3

### Series e Indexación y selección de datos

Serie: tipo numpy

In [21]:
sr = pd.Series([10,9,8,7,6])

In [23]:
sr.index ## conocemos el rango de la serie

RangeIndex(start=0, stop=5, step=1)

In [25]:
sr.shape ## conocer la dimensión

(5,)

In [30]:
sr[[0,4,2]] ## con lista se llaman elementos

0    10
4     6
2     8
dtype: int64

In [32]:
sr = pd.Series([0,4,2,5,8], index = ['a','b','c','d','e'])

In [37]:
sr[['c','d']]

c    2
d    5
dtype: int64

In [56]:
dict_data = { 'CO':100,'MX':200,'AR':300}
dict_data['AR']

300

In [43]:
pd.Series(diccionario, index = ['CO','MX','AR','PER']) ## Hay un NaN

CO     100.0
MX     200.0
AR     300.0
PER      NaN
dtype: float64

In [47]:
np.nan ## variable nula que cumple una función matematica.

nan

In [48]:
sr = pd.Series(diccionario, index = ['CO','MX','AR','PER'])

In [50]:
sr.isnull() ## función para encontrar donde hay un null

CO     False
MX     False
AR     False
PER     True
dtype: bool

sr.notnull() ## función para encontrar los que no son nulos

### De paneles de datos al DataFrame

El diccionario se puede transformar a una serie, pero tambien se pueden crear objetos mas complejos como el dataframe desde un diccionario

In [58]:
dict_data = {'CO':[100,800,200],'MX':[100,200,300],'AR':[300,500,400]}

In [61]:
df = pd.DataFrame(dict_data)
df

    CO   MX   AR
0  100  100  300
1  800  200  500
2  200  300  400

In [73]:
dict_data = {
    'edad':[10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais': ['co','mx','co','mx','mx','ch','ch'],
    'genero': ['M','F','F','M','M','M','F'],
    'Q1': [5,10,8,np.nan,7,8,3],
    'Q2': [7,9,9,8,8,8,9.0]
}
## tambien se pueden definir index en el data frame
df = pd.DataFrame(dict_data, index = ['ana','javier','fabian','julian','norberto','jesus','daniel'])
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
javier       9  110   mx      F  10.0  9.0
fabian      13  130   co      F   8.0  9.0
julian      14  155   mx      M   NaN  8.0
norberto    12  125   mx      M   7.0  8.0
jesus       11  120   ch      M   8.0  8.0
daniel      12  125   ch      F   3.0  9.0

In [69]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [71]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

In [72]:
df['edad']

0    10
1     9
2    13
3    14
4    12
5    11
6    12
Name: edad, dtype: int64

In [75]:
df.loc['ana'] ## me trae los datos de una fila

edad       10
cm        115
pais       co
genero      M
Q1          5
Q2          7
Name: ana, dtype: object

In [77]:
df.loc[['ana','fabian']] ## traer subconjuntos

        edad   cm pais genero   Q1   Q2
ana       10  115   co      M  5.0  7.0
fabian    13  130   co      F  8.0  9.0

In [80]:
df.loc['julian','Q1'] ## traer datos con nombre de filas

nan

In [82]:
df.iloc[2,1] ## usar posición para traer datos dentro del dataframe

130

In [83]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
javier       9  110   mx      F  10.0  9.0
fabian      13  130   co      F   8.0  9.0
julian      14  155   mx      M   NaN  8.0
norberto    12  125   mx      M   7.0  8.0
jesus       11  120   ch      M   8.0  8.0
daniel      12  125   ch      F   3.0  9.0

In [87]:
df.iloc[2,[1,3]] ## trae los datos de la 3ra fila con los datos de las columnas del 
##1 al 3

cm        130
genero      F
Name: fabian, dtype: object

In [89]:
df.iloc[:,[1,3]] ## para todas las filas

           cm genero
ana       115      M
javier    110      F
fabian    130      F
julian    155      M
norberto  125      M
jesus     120      M
daniel    125      F

In [92]:
df[df['edad'] >= 12] #trae el data frame con un solo condicional

          edad   cm pais genero   Q1   Q2
fabian      13  130   co      F  8.0  9.0
julian      14  155   mx      M  NaN  8.0
norberto    12  125   mx      M  7.0  8.0
daniel      12  125   ch      F  3.0  9.0

In [95]:
df[(df['edad'] >= 12) & (df['pais'] == 'mx')]

          edad   cm pais genero   Q1   Q2
julian      14  155   mx      M  NaN  8.0
norberto    12  125   mx      M  7.0  8.0

In [98]:
 df.query('edad > 12') # usando query

        edad   cm pais genero   Q1   Q2
fabian    13  130   co      F  8.0  9.0
julian    14  155   mx      M  NaN  8.0

In [101]:
df[df['Q2'] >= df['Q1']]

          edad   cm pais genero   Q1   Q2
ana         10  115   co      M  5.0  7.0
fabian      13  130   co      F  8.0  9.0
norberto    12  125   mx      M  7.0  8.0
jesus       11  120   ch      M  8.0  8.0
daniel      12  125   ch      F  3.0  9.0

### Indexado y manejo de Archivos .CSV

como trabajar con formatos texto, por ejemplo

In [103]:
'hola {}'.format('mundo') ## sirve mucho para hacer funciones y condicionales

'hola mundo'

In [105]:
%cd Documents

C:\Users\GAMER\Documents